app/controllers/products_controller.rb

    def show
        @store = Store.find(params[:store_id])
        @product = @store.products.find(params[:id])
---
SELECT "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "products".* FROM "products" WHERE "products"."store_id" = ? AND "products"."id" = ? LIMIT ?  [["store_id", 1], ["id", 1], ["LIMIT", 1]]